---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ModelText
source: html/d9725e63-08f7-b8f3-67a5-2dee38085d4f.htm
---
# ModelText Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.